post/Learning/计算机学习/从零开始认识计算机.org
#+TITLE: 从零开始认识计算机(from 硬件茶谈)
#+DATE: <2023-06-08 四 00:06>
#+DESCRIPTION: 内容来自B站UP主“硬件茶谈”的视频，请多多支持原视频，本blog仅为学习笔记

#+OPTIONS: html5-fancy:t
#+setupfile: ../../../setup.setup
# #+setupfile: https://yzs249175311.github.io/org-html-theme-dull/org-html-theme-dull.setup
# #+HTML_HEAD_EXTRA: <style> @import url('https://fonts.googleapis.com/css2?family=Roboto+Mono&display=swap');pre{font-family:\"Noto Sans Mono,Noto Sans SC,monospace\"!important;} </style>

#+begin_export html
<style type="text/css" media="screen">
  pre { font-family: Noto Sans Mono CJK, Droid Sans Mono, Monaco, Consolas, "Lucida Console", monospace; }
</style>
#+end_export

* 认识MOSFET
** 物质结构
- 分子组成物质
- 原子组成分子
- 原子由 _电子_ _质子_ _中子_ 组成
- 电子带负电，质子带正电
- 电子围绕原子核活动，但轨迹不确定，因而使用电子云描述运动范围
** 电
缺失电子的原子显正电性，多出的显负电性
*** 电流
电流需要导体传播。根据导电性，材料可以被分为 _导体_ _绝缘体_ 和 _半导体_ 三种
材料
**** 导体
以铜为例，其最外围的电子不稳定，易摆脱束缚。

将铜做成导线，连接电源、用电器构成回路。此时电源的电压驱使铜线上的电子定向移动，
形成电流

注意！电子带的负电，但电流规定的是正电荷的流动方向。所以电流方向与电子移动方向相
反。（电子从电源负极移动到正极，电流则相反）
**** 半导体
外界条件变换是，可以在导体与绝缘体之间转换

以硅为例。纯硅类绝缘体，
***** N型掺杂
在硅中，掺杂磷元素，可增加电子（显中性）

其中，电荷的载体（载流子）是电子
***** P型掺杂
在硅中，掺杂硼元素，可减少电子（增加空穴），形成空穴（显中性）

其中，载流子是空穴
*** PN结
在同一块硅晶体中进行N型与P型掺杂就形成了PN结，该材料内部具有扩散作用，电子会从N
区扩散到P区和空穴结合，在扩散后，N区显正电性，P区显负电性，形成从正电性指向负电
性区域的电场（从N指向P区），会驱使电子移动（移动方向与电场指向相反）。

当该电场形成的作用力与材料本身的扩散作用相等时，达成平衡。而两者交界处缺乏载流子、
存在内电场的区域被称为耗尽层（耗尽层可以理解为绝缘区域，电子不能进入或者离开，是
扩散作用和内建电场平衡后的结果）。
**** 特性
若让PN结接入回路，若电源正极接P区，负极接N区，其提供的电场方向是从P区到N区的（正
极指向负极），将抵消掉内建电场，并使电流畅通。
#+begin_src text
    ,----------------------.
    | 可以导电时的示意图： |
    `----------------------'

                   PN结  ---.
                            |
                            V

             +--------------+--------------+
          -  | N区 正电性+  | P区 负电性-  |  +
          -  | --内建电场-> | <-电子--     |  +
    ,---- -  |              |              |  + ----.
    |     -  |       <-电池提供电场--      |  +     |
    |     -  |              |              |  +     |
    |        +--------------+--------------+        |
    |                                               |
    |                                               |
    |                                               |
    |          ,-----------.        ,---.           |
    `----------|  -  |  +  |--------| * |-----------'
               `-----------'        `---'
                     ^                ^
                     |                |
                   电源             用电器
#+end_src
若电源反接，则会导致内建电场加强，电子移动到N区，空穴移动到P区，耗尽层被加宽，于
是电子几乎不可能再从P区移动到N区（不可能穿过耗尽层）。
#+begin_src text
    ,------------------------.
    | 不可以导电时的示意图： |
    `------------------------'

                   PN结  ---.
                            |
                            V

             +--------------+--------------+
          +  | N区 正电性+  | P区 负电性-  |  -
          +  | --内建电场-> | <-电子--     |  -
    ,---- +  |              |              |  - ----.
    |     +  |       --电池提供电场->      |  -     |
    |     +  |              |              |  -     |
    |        +--------------+--------------+        |
    |                                               |
    |                                               |
    |                                               |
    |          ,-----------.        ,---.           |
    `----------|  +  |  -  |--------| * |-----------'
               `-----------'        `---'
                     ^                ^
                     |                |
                   电源             用电器
#+end_src
换种方式理解就是这样：
#+begin_src text
  ,-----------------------------------------------------.
  |                                                     |
  |               内建电场 = 扩散作用                   |
  |                N <- P     N -> P                    |
  |                                                     |
  |                        ||                           |
  |                        ||                           |
  |                        ||                           |
  |    值上升              VV       值也要对应地上升    |
  |       |                                      |      |
  |       `- 内建电场 + 电池提供电场 = 扩散作用 -'      |
  |                                                     |
  `-----------------------------------------------------'
#+end_src
由于驱使电子运动的力均上升，所以耗尽层被加宽，电子将不能通过耗尽层形成通路。（即
内建电场不可提升，但是扩散作用可以提升，所以要打破平衡就必须要让电池提供的电场与
内建电场相反。）
**** 总结
PN结实际上就是一个二极管，电流可以由P流向N，但是不能够从N流向P，实现电流单向流动
*** MOSFET
**** 基本概念
先来认识一下MOSFET的基本结构。
#+begin_src text
  ,----------------------------------------------------------------------------.
  |       ###|                 |###            ###|                 |###       |
  |       ###|               ------->        <-------               |###       |
  |       ###|                 |###            ###|                 |###       |
  |       ###|       N型       |###            ###|       N型       |###       |
  |       ###|                 |###            ###|                 |###       |
  |       ###|  内建电场指向 ------->        <------- 内建电场指向  |###       |
  |       ###|   |        |    |###            ###|   |        |    |###       |
  |       ###`---|--------|----'###            ###`---|--------|----'###       |
  |       #######|#耗尽层#|########            #######|#耗尽层#|########       |
  |       #######|########|########            #######|########|########       |
  |              V        V                           V        V               |
  |                                                                            |
  |                                  P型                                       |
  |                                                                            |
  `----------------------------------------------------------------------------'
#+end_src
其描述为：在一块纯硅上进行P型掺杂，在其肩膀部分进行N型掺杂。（如上画）

倘若我们将N型掺杂的部分接上导线，连接电源和用电器，开关闭合，此时在电流由P流向N
的区域电流导通，但是由N->P的区域电流不导通，不构成通路。

若将电源反接，同理，电路同样不导通。
#+begin_src text
                                       <---电流方向----
  ,--------------------------.                             |      ,--------------------------.
  |                          |    -----                 ---+---   |                          |
  |                          |                             |      |                          |
  |                          |                                    |                          |
  |                  =================                    =================                  |
  |      ,----------------------------------------------------------------------------.      |
  |      |       ###|                 |###            ###|                 |###       |      |
  |      |       ###|               ------->        <-------               |###       |      |
  |      |       ###|                 |###            ###|                 |###       |      |
  |      |       ###|       N型       |###            ###|       N型       |###       |      |
  |      |       ###|                 |###            ###|                 |###       |      |
  |      |       ###|  内建电场指向 ------->        <------- 内建电场指向  |###       |      |
  |      |       ###|   |        |    |###            ###|   |        |    |###       |      |
  |      |       ###`---|--------|----'###            ###`---|--------|----'###       |      |
  |      |       #######|#耗尽层#|########            #######|#耗尽层#|########       |      |
  |      |       #######|########|########            #######|########|########       |      |
  |      |              V        V                           V        V               |      |
  |      |                                                                            |      |
  |      |                  /\              P型                  /\                   |      |
  |      |                  ||                                   ||                   |      |
  |      |                  ||                                   ||                   |      |
  |      |                  ||                                   ||                   |      |
  |      |               此侧导通                            此侧不导通               |      |
  |      |                                                                            |      |
  |      |                                                                            |      |
  |      `----------------------------------------------------------------------------'      |
  |										           |
  |										           |
  |										           |
  |                                ,-----------.        ,---.                                |
  `--------------------------------|  -  |  +  |--------| * |--------------------------------'
                                   `-----------'        `---'
                                         ^                ^
                                         |                |
                                       电源             用电器
#+end_src
**** 特性
这时候你就可能会问了：“欸你这东西讲了半天都还是不导通啊，有什么用啊？”

很明显，这玩意肯定由什么特殊的作用，要不然我也不会介绍那么久。这玩意虽然在这种自
然状态下没有办法导电，但是实际上还是有办法导电的。

为了理解它，我先举一个例子：
#+begin_src text
                   ----电流方向-->
     ,------------------------------------------.
     |           <--电子运动方向----            |
     |                                          |
  ,-----.                                       |
  |     |                电子从这转移  ++++++   |  ++++++
  |  +  |                     ||                |             
  |     |                     ||        =================   <-----------\
  |-----|                     ||        #################   <-- 绝缘层   +-- 金属板
  |     |                     ||        =================   <-----------/
  |  -  |                     \/                |
  |     |                   到这边     ------   |  ------
  `-----'                                       |
     |                                          |
     |                                          |
     `------------------------------------------'
#+end_src
以上例子中，在开关闭合的情况下，电子从上层金属板转移到下层金属板，使上层金属板显
正电性，而下层显负电性，绝缘层中出现从上到下的指向性电场。

若将该结构如下图般安置，
#+begin_src text
       ,------------------------------------------.
       |                                          |
  ,---/|\-----------------------.                 |                  ,-----------------------.
  |    |                        |       + ================== +       |                       |
  |    |                        |         ##################         |                       |
  |    |                        |         ######绝缘体######         |                       |
  |    |                ================= ################## =================               |
  |    |    ,----------------------------------------------------------------------------.   |
  |    |    |       ###|                 |###            ###|                 |###       |   |
  |  ,---.  |       ###|                 |###            ###|                 |###       |   |
  |  | + |  |       ###|                 |###            ###|                 |###       |   |
  |  |---|  |       ###|       N型       |###            ###|       N型       |###       |   |
  |  | - |  |       ###|                 |###            ###|                 |###       |   |
  |  `---'  |       ###|                 |###            ###|                 |###       |   |
  |    |    |       ###|                 |###            ###|                 |###       |   |
  |    |    |       ###`-----------------'###            ###`-----------------'###       |   |
  |    |    |       #########耗尽层##########            #########耗尽层##########       |   |
  |    |    |       #########################            #########################       |   |
  |    |    |                                                                            |   |
  |    |    |                                                                            |   |
  |    |    |                                  P型                                       |   |
  |    |    |                                                                            |   |
  |    |    |                                                                            |   |
  |    |    `----------------------------------------------------------------------------'   |
  |    |                    - ============================================ -                 |
  |    |                                           |                                         |
  |    |                                           |                                         |
  |    --------------------------------------------'                                         |
  |                                                                                          |
  |                                                                                          |
  |                                   ,-----------.        ,---.                             |
  `-----------------------------------|  -  |  +  |--------| * |-----------------------------'
                                      `-----------'        `---'
                                            ^                ^
                                            |                |
                                          电源             用电器
#+end_src
